## **[MySQL Subquery](https://www.mysqltutorial.org/mysql-subquery/)**

Use the MySQL subquery to write complex queries and explain the correlated subquery concept.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to the MySQL Subquery

In [3]:
Image('../images/mysql-subquery.gif')

### Using a MySQL subquery in the WHERE clause

- MySQL subquery with comparison operators

In [4]:
string = '''
SELECT customerNumber, checkNumber, amount
FROM payments
WHERE amount = (SELECT MAX(amount) FROM payments)
;'''

pd.read_sql(string, engine)

   customerNumber checkNumber     amount
0             141    JE105477  120166.58

In [5]:
(pd
 .read_sql_table('payments', engine)
 .nlargest(n=1, columns='amount')
 [['customerNumber', 'checkNumber', 'amount']]
 .reset_index(drop=True)
)

   customerNumber checkNumber     amount
0             141    JE105477  120166.58

In [6]:
string = '''
SELECT customerNumber, checkNumber, amount
FROM payments
ORDER BY amount DESC
LIMIT 1
;'''

pd.read_sql(string, engine)

   customerNumber checkNumber     amount
0             141    JE105477  120166.58

# OperationalError
string = '''
SELECT
    customerNumber,
    checkNumber,
    MAX(amount) AS amount
FROM
    payments
;'''

pd.read_sql(string, engine)

- MySQL subquery with `IN` and `NOT IN` operators

Find the customers who have not placed any orders as follows:

In [7]:
string = '''
SELECT customerName
FROM customers
WHERE customerNumber NOT IN (
        SELECT DISTINCT customerNumber
        FROM orders)
;'''

df1 = pd.read_sql(string, engine)

In [8]:
cusnum_orders = (
    pd.read_sql_table('orders', engine, columns=['customerNumber'])
    ['customerNumber']
    .unique()
)

df2 = (
    pd.read_sql_table('customers', engine)
    .query("customerNumber not in @cusnum_orders")
    [['customerName']]
    .reset_index(drop=True)    
)

In [9]:
df1.equals(df2)

True

### MySQL subquery in the `FROM` clause

Find the maximum, minimum, and average number of items in sale orders from a standalone subquery:

In [10]:
string = '''
SELECT
    MAX(items) max_items,
    MIN(items) min_items,
    FLOOR(AVG(items)) floor_avg_items
FROM
    (SELECT
        #orderNumber, 
        COUNT(orderNumber) AS items
    FROM orderdetails
    GROUP BY orderNumber) AS lineitems 
    # Every derived table must have its own alias
;'''
pd.read_sql(string, engine)

   max_items  min_items  floor_avg_items
0         18          1              9.0

In [11]:
def floor_avg(s):
    return np.floor(s.mean())

def convert_int(df):
    return (df
            .assign(max_items = df.max_items.astype(int),
                    min_items = df.min_items.astype(int))
           )

lineitems = pd.DataFrame(
    pd.read_sql_table('orderdetails', engine, columns=['orderNumber'])
    ['orderNumber']
    .value_counts()
    .rename('items')
)

lineitems = (
    lineitems
    .agg(max_items = pd.NamedAgg(column='items', aggfunc='max'), 
         min_items = pd.NamedAgg(column='items', aggfunc='min'),
         floor_avg_items = pd.NamedAgg(column='items', aggfunc=floor_avg))
    .T
    .pipe(convert_int)
    .reset_index(drop=True)
)

In [12]:
lineitems

   max_items  min_items  floor_avg_items
0         18          1              9.0

- MySQL correlated subquery: a subquery that uses data from the outer query.

Outer or inner table's aliases result in different results:

In [13]:
string0 = '''
SELECT productLine, productName, buyPrice
FROM products p1
WHERE buyPrice > (
    SELECT AVG(buyPrice)
    FROM products p2 # alias here is not nessesary
    WHERE p1.productLine = p2.productLine)
ORDER BY productLine, productName
;'''

string1 = '''
SELECT productLine, productName, buyPrice
FROM products
WHERE buyPrice > (
    SELECT AVG(buyPrice)
    FROM products p2
    WHERE p2.productLine = productLine)
ORDER BY productLine, productName
;'''

df0 = pd.read_sql(string0, engine)
df1 = pd.read_sql(string1, engine)

In [14]:
print(df0.shape)
df0.head(2)

(55, 3)

    productLine               productName  buyPrice
0  Classic Cars  1952 Alpine Renault 1300     98.58
1  Classic Cars         1952 Citroen-15CV     72.82

In [15]:
print(df1.shape)
df1.head(3)

(54, 3)

    productLine                     productName  buyPrice
0  Classic Cars  1948 Porsche Type 356 Roadster     62.16
1  Classic Cars        1952 Alpine Renault 1300     98.58
2  Classic Cars               1952 Citroen-15CV     72.82

In [16]:
products = pd.read_sql_table(
    'products', engine, columns=['productLine', 'productName', 'buyPrice'])
products.head()

,productLine,productName,buyPrice
0,Motorcycles,1969 Harley Davidson Ultimate Chopper,48.81
1,Classic Cars,1952 Alpine Renault 1300,98.58
2,Motorcycles,1996 Moto Guzzi 1100i,68.99
3,Motorcycles,2003 Harley-Davidson Eagle Drag Bike,91.02
4,Classic Cars,1972 Alfa Romeo GTA,85.68

In [17]:
(products
 .groupby('productLine')
 .agg(buyPrice_mean = pd.NamedAgg(
     column='buyPrice', aggfunc='mean'))
)

                  buyPrice_mean
productLine
Classic Cars          64.446316
Motorcycles           50.685385
Planes                49.629167
Ships                 47.007778
Trains                43.923333
Trucks and Buses      56.329091
Vintage Cars          46.066250

In [18]:
df2 = (
    products
    .merge(
        products
        .groupby('productLine')
        .agg(buyPrice_mean = pd.NamedAgg(
            column='buyPrice', aggfunc = 'mean')),
        left_on='productLine',
        right_index=True,
    )
    .query('buyPrice > buyPrice_mean')
    [['productLine', 'productName', 'buyPrice']]
    .sort_values(['productLine', 'productName'],
                 key=lambda col: col.str.lower())
    .reset_index(drop=True)
)

In [19]:
df0.equals(df2)

True

In [20]:
df0

,productLine,productName,buyPrice
0,Classic Cars,1952 Alpine Renault 1300,98.58
1,Classic Cars,1952 Citroen-15CV,72.82
2,Classic Cars,1956 Porsche 356A Coupe,98.30
3,Classic Cars,1957 Corvette Convertible,69.93
4,Classic Cars,1962 LanciaA Delta 16V,103.42
...,...,...,...
50,Vintage Cars,1932 Model A Ford J-Coupe,58.48
51,Vintage Cars,1936 Chrysler Airflow,57.46
52,Vintage Cars,1937 Lincoln Berline,60.62
53,Vintage Cars,1940 Ford Delivery Sedan,48.64
54,Vintage Cars,1941 Chevrolet Special Deluxe Cabriolet,64.58

- MySQL subquery with `EXISTS` and `NOT EXISTS`

Find sales orders whose total values are greater than 60K

In [21]:
string1 = '''
SELECT
    orderNumber,
    SUM(priceEach * quantityOrdered) total
FROM orderdetails
INNER JOIN orders USING (orderNumber)
GROUP BY orderNumber
HAVING SUM(priceEach * quantityOrdered) > 60000
;'''

string2 = '''
SELECT
    orderNumber,
    SUM(priceEach * quantityOrdered) total
FROM orderdetails
GROUP BY orderNumber
HAVING total > 60000
;'''

pd.read_sql(string1, engine)
# pd.read_sql(string2, engine)

   orderNumber     total
0        10165  67392.85
1        10310  61234.67
2        10287  61402.00

Find customers who placed at least one sales order with the total value greater than 60K

In [22]:
string = '''
# EXPLAIN
SELECT customerNumber, customerName
FROM customers
WHERE EXISTS (
    SELECT orderNumber, SUM(priceEach * quantityOrdered) total
    FROM orderdetails
    INNER JOIN orders USING (orderNumber)
    WHERE customerNumber = customers.customerNumber
    GROUP BY orderNumber
    HAVING total > 60000)
;'''

df1 = pd.read_sql(string, engine)

In [23]:
customers = pd.read_sql_table(
    'customers', engine, columns=['customerNumber', 'customerName'])

orderdetails = (
    pd.read_sql_table('orderdetails', engine)
    .merge(pd.read_sql_table('orders', engine),
           on='orderNumber',
           how='inner')
    .assign(total = lambda df: df.priceEach * df.quantityOrdered)
    .groupby(['orderNumber', 'customerNumber'], as_index=False)
    .agg({'total': 'sum'})
    .query('total > 60000')
)

df2 = (
    customers
    .merge(orderdetails, on='customerNumber', how='inner')
    [['customerNumber', 'customerName']]
)

In [24]:
df1.equals(df2)

True

In [25]:
df1

   customerNumber             customerName
0             148  Dragon Souveniers, Ltd.
1             259  Toms Spezialitäten, Ltd
2             298          Vida Sport, Ltd